r6g-c_rw.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 2363.67 qps: 47290.61 (r/w/o: 33104.60/9455.22/4730.79) lat (ms,95%): 36.24 err/s: 0.30 reconn/s: 0.00
[ 40s ] thds: 64 tps: 2401.52 qps: 48089.34 (r/w/o: 33665.93/9619.63/4803.79) lat (ms,95%): 35.59 err/s: 0.70 reconn/s: 0.00
[ 60s ] thds: 64 tps: 2413.65 qps: 48265.33 (r/w/o: 33794.30/9643.29/4827.74) lat (ms,95%): 44.17 err/s: 0.45 reconn/s: 0.00
[ 80s ] thds: 64 tps: 2401.51 qps: 48023.02 (r/w/o: 33611.07/9607.68/4804.27) lat (ms,95%): 46.63 err/s: 1.25 reconn/s: 0.00
[ 100s ] thds: 64 tps: 2438.05 qps: 48755.89 (r/w/o: 34126.66/9752.82/4876.41) lat (ms,95%): 35.59 err/s: 0.35 reconn/s: 0.00
[ 120s ] thds: 64 tps: 2555.55 qps: 51123.11 (r/w/o: 35788.59/10223.66/5110.86) lat (ms,95%): 31.37 err/s: 0.70 reconn/s: 0.00
[ 140s ] thds: 64 tps: 2509.64 qps: 50257.81 (r/w/o: 35185.47/10051.41/5020.93) lat (ms,95%): 38.25 err/s: 0.65 reconn/s: 0.00
[ 160s ] thds: 64 tps: 2562.05 qps: 51255.40 (r/w/o: 35882.75/10247.55/5125.10) lat (ms,95%): 30.26 err/s: 1.00 reconn/s: 0.00
[ 180s ] thds: 64 tps: 2535.14 qps: 50694.61 (r/w/o: 35490.44/10133.05/5071.13) lat (ms,95%): 32.53 err/s: 0.85 reconn/s: 0.00
[ 200s ] thds: 64 tps: 2551.53 qps: 51061.28 (r/w/o: 35746.24/10210.98/5104.06) lat (ms,95%): 31.94 err/s: 1.00 reconn/s: 0.00
[ 220s ] thds: 64 tps: 2555.28 qps: 51128.61 (r/w/o: 35786.31/10231.03/5111.27) lat (ms,95%): 36.24 err/s: 0.70 reconn/s: 0.00
[ 240s ] thds: 64 tps: 2587.54 qps: 51733.70 (r/w/o: 36219.44/10338.59/5175.67) lat (ms,95%): 30.81 err/s: 0.60 reconn/s: 0.00
[ 260s ] thds: 64 tps: 2579.71 qps: 51613.65 (r/w/o: 36133.10/10320.43/5160.11) lat (ms,95%): 30.81 err/s: 0.75 reconn/s: 0.00
[ 280s ] thds: 64 tps: 2514.35 qps: 50273.97 (r/w/o: 35185.70/10059.21/5029.06) lat (ms,95%): 42.61 err/s: 0.45 reconn/s: 0.00
[ 300s ] thds: 64 tps: 2603.83 qps: 52105.06 (r/w/o: 36481.21/10415.13/5208.72) lat (ms,95%): 31.37 err/s: 1.00 reconn/s: 0.00
[ 320s ] thds: 64 tps: 2620.74 qps: 52426.12 (r/w/o: 36697.05/10486.84/5242.22) lat (ms,95%): 32.53 err/s: 0.65 reconn/s: 0.00
[ 340s ] thds: 64 tps: 2573.63 qps: 51484.21 (r/w/o: 36042.43/10294.02/5147.76) lat (ms,95%): 32.53 err/s: 0.50 reconn/s: 0.00
[ 360s ] thds: 64 tps: 2659.65 qps: 53179.91 (r/w/o: 37221.39/10638.48/5320.04) lat (ms,95%): 29.72 err/s: 0.80 reconn/s: 0.00
[ 380s ] thds: 64 tps: 2612.97 qps: 52269.37 (r/w/o: 36590.26/10452.77/5226.34) lat (ms,95%): 33.72 err/s: 0.45 reconn/s: 0.00
[ 400s ] thds: 64 tps: 2561.99 qps: 51303.26 (r/w/o: 35916.37/10261.91/5124.98) lat (ms,95%): 40.37 err/s: 0.90 reconn/s: 0.00
[ 420s ] thds: 64 tps: 2665.18 qps: 53289.59 (r/w/o: 37308.93/10649.81/5330.85) lat (ms,95%): 29.72 err/s: 0.70 reconn/s: 0.00
[ 440s ] thds: 64 tps: 2623.01 qps: 52483.57 (r/w/o: 36743.19/10493.37/5247.01) lat (ms,95%): 33.12 err/s: 0.80 reconn/s: 0.00
[ 460s ] thds: 64 tps: 2642.95 qps: 52862.19 (r/w/o: 37003.36/10572.34/5286.49) lat (ms,95%): 31.94 err/s: 0.60 reconn/s: 0.00
[ 480s ] thds: 64 tps: 2641.31 qps: 52854.52 (r/w/o: 36997.27/10573.88/5283.37) lat (ms,95%): 32.53 err/s: 0.80 reconn/s: 0.00
[ 500s ] thds: 64 tps: 2597.46 qps: 51972.45 (r/w/o: 36380.33/10396.15/5195.98) lat (ms,95%): 36.89 err/s: 1.00 reconn/s: 0.00
[ 520s ] thds: 64 tps: 2700.11 qps: 53995.79 (r/w/o: 37798.65/10797.11/5400.03) lat (ms,95%): 29.19 err/s: 0.90 reconn/s: 0.00
[ 540s ] thds: 64 tps: 2622.28 qps: 52479.99 (r/w/o: 36738.15/10495.43/5246.41) lat (ms,95%): 32.53 err/s: 0.75 reconn/s: 0.00
[ 560s ] thds: 64 tps: 2680.50 qps: 53592.54 (r/w/o: 37516.29/10716.00/5360.25) lat (ms,95%): 29.72 err/s: 0.55 reconn/s: 0.00
[ 580s ] thds: 64 tps: 2642.22 qps: 52829.59 (r/w/o: 36979.06/10565.19/5285.34) lat (ms,95%): 31.37 err/s: 1.00 reconn/s: 0.00
[ 600s ] thds: 64 tps: 2708.83 qps: 54249.39 (r/w/o: 37980.09/10849.38/5419.91) lat (ms,95%): 27.66 err/s: 0.85 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            21602336
        write:                           6171065
        other:                           3085608
        total:                           30859009
    transactions:                        1542584 (2570.45 per sec.)
    queries:                             30859009 (51421.21 per sec.)
    ignored errors:                      440    (0.73 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.1209s
    total number of events:              1542584

Latency (ms):
         min:                                    6.70
         avg:                                   24.89
         max:                                  169.23
         95th percentile:                       33.12
         sum:                             38398661.66

Threads fairness:
    events (avg/stddev):           24102.8750/74.84
    execution time (avg/stddev):   599.9791/0.01