r6g-c_write.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 5125.49 qps: 30775.49 (r/w/o: 0.00/20519.06/10256.43) lat (ms,95%): 17.95 err/s: 2.25 reconn/s: 0.00
[ 40s ] thds: 64 tps: 5558.69 qps: 33353.22 (r/w/o: 0.00/22234.10/11119.12) lat (ms,95%): 15.27 err/s: 1.75 reconn/s: 0.00
[ 60s ] thds: 64 tps: 5532.02 qps: 33199.88 (r/w/o: 0.00/22134.39/11065.49) lat (ms,95%): 16.41 err/s: 1.45 reconn/s: 0.00
[ 80s ] thds: 64 tps: 5612.10 qps: 33676.94 (r/w/o: 0.00/22451.19/11225.75) lat (ms,95%): 15.00 err/s: 1.55 reconn/s: 0.00
[ 100s ] thds: 64 tps: 5652.35 qps: 33919.80 (r/w/o: 0.00/22613.05/11306.75) lat (ms,95%): 15.00 err/s: 2.05 reconn/s: 0.00
[ 120s ] thds: 64 tps: 5680.40 qps: 34087.98 (r/w/o: 0.00/22725.24/11362.74) lat (ms,95%): 15.00 err/s: 1.95 reconn/s: 0.00
[ 140s ] thds: 64 tps: 5696.47 qps: 34170.20 (r/w/o: 0.00/22776.35/11393.85) lat (ms,95%): 15.00 err/s: 1.80 reconn/s: 0.00
[ 160s ] thds: 64 tps: 5662.15 qps: 33978.72 (r/w/o: 0.00/22653.42/11325.31) lat (ms,95%): 15.00 err/s: 1.60 reconn/s: 0.00
[ 180s ] thds: 64 tps: 5684.27 qps: 34122.15 (r/w/o: 0.00/22750.50/11371.65) lat (ms,95%): 15.55 err/s: 1.60 reconn/s: 0.00
[ 200s ] thds: 64 tps: 5686.65 qps: 34126.40 (r/w/o: 0.00/22750.70/11375.70) lat (ms,95%): 15.55 err/s: 2.40 reconn/s: 0.00
[ 220s ] thds: 64 tps: 5760.89 qps: 34563.74 (r/w/o: 0.00/23040.21/11523.53) lat (ms,95%): 15.00 err/s: 1.75 reconn/s: 0.00
[ 240s ] thds: 64 tps: 5624.72 qps: 33749.15 (r/w/o: 0.00/22497.37/11251.78) lat (ms,95%): 16.12 err/s: 2.35 reconn/s: 0.00
[ 260s ] thds: 64 tps: 5617.59 qps: 33716.28 (r/w/o: 0.00/22479.65/11236.63) lat (ms,95%): 16.41 err/s: 1.70 reconn/s: 0.00
[ 280s ] thds: 64 tps: 5709.95 qps: 34271.55 (r/w/o: 0.00/22849.55/11422.00) lat (ms,95%): 15.27 err/s: 1.85 reconn/s: 0.00
[ 300s ] thds: 64 tps: 5665.75 qps: 34000.30 (r/w/o: 0.00/22666.70/11333.60) lat (ms,95%): 15.83 err/s: 2.10 reconn/s: 0.00
[ 320s ] thds: 64 tps: 5646.32 qps: 33869.72 (r/w/o: 0.00/22576.03/11293.69) lat (ms,95%): 15.83 err/s: 1.95 reconn/s: 0.00
[ 340s ] thds: 64 tps: 5773.67 qps: 34658.20 (r/w/o: 0.00/23108.55/11549.65) lat (ms,95%): 14.73 err/s: 1.60 reconn/s: 0.00
[ 360s ] thds: 64 tps: 5671.61 qps: 34035.74 (r/w/o: 0.00/22690.88/11344.86) lat (ms,95%): 15.55 err/s: 1.45 reconn/s: 0.00
[ 380s ] thds: 64 tps: 5720.46 qps: 34324.18 (r/w/o: 0.00/22881.37/11442.81) lat (ms,95%): 14.73 err/s: 1.90 reconn/s: 0.00
[ 400s ] thds: 64 tps: 5703.84 qps: 34233.66 (r/w/o: 0.00/22823.68/11409.99) lat (ms,95%): 15.55 err/s: 2.30 reconn/s: 0.00
[ 420s ] thds: 64 tps: 5749.85 qps: 34503.10 (r/w/o: 0.00/23002.00/11501.10) lat (ms,95%): 15.55 err/s: 1.40 reconn/s: 0.00
[ 440s ] thds: 64 tps: 5668.75 qps: 34018.48 (r/w/o: 0.00/22678.64/11339.84) lat (ms,95%): 16.12 err/s: 2.40 reconn/s: 0.00
[ 460s ] thds: 64 tps: 5747.85 qps: 34488.83 (r/w/o: 0.00/22990.77/11498.06) lat (ms,95%): 15.00 err/s: 2.30 reconn/s: 0.00
[ 480s ] thds: 64 tps: 5700.64 qps: 34205.73 (r/w/o: 0.00/22802.20/11403.53) lat (ms,95%): 16.12 err/s: 2.25 reconn/s: 0.00
[ 500s ] thds: 64 tps: 5713.22 qps: 34288.71 (r/w/o: 0.00/22860.67/11428.04) lat (ms,95%): 15.83 err/s: 1.60 reconn/s: 0.00
[ 520s ] thds: 64 tps: 5741.69 qps: 34451.00 (r/w/o: 0.00/22966.47/11484.53) lat (ms,95%): 15.27 err/s: 1.20 reconn/s: 0.00
[ 540s ] thds: 64 tps: 5763.72 qps: 34597.63 (r/w/o: 0.00/23067.54/11530.09) lat (ms,95%): 14.73 err/s: 2.60 reconn/s: 0.00
[ 560s ] thds: 64 tps: 5680.08 qps: 34086.16 (r/w/o: 0.00/22723.96/11362.20) lat (ms,95%): 15.55 err/s: 2.05 reconn/s: 0.00
[ 580s ] thds: 64 tps: 5699.73 qps: 34188.25 (r/w/o: 0.00/22789.58/11398.67) lat (ms,95%): 15.27 err/s: 2.00 reconn/s: 0.00
[ 600s ] thds: 64 tps: 5698.77 qps: 34213.45 (r/w/o: 0.00/22811.27/11402.18) lat (ms,95%): 15.27 err/s: 1.85 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           13598330
        other:                           6799270
        total:                           20397600
    transactions:                        3399065 (5664.49 per sec.)
    queries:                             20397600 (33992.27 per sec.)
    ignored errors:                      1140   (1.90 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0646s
    total number of events:              3399065

Latency (ms):
         min:                                    3.29
         avg:                                   11.30
         max:                                   98.98
         95th percentile:                       15.55
         sum:                             38395230.91

Threads fairness:
    events (avg/stddev):           53110.3906/261.18
    execution time (avg/stddev):   599.9255/0.01